Revit 2024 API
MultiReferenceAnnotationType.CreateDefault Method
 Creates the first MultiReferenceAnnotationType element and adds it to the document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public static MultiReferenceAnnotationType CreateDefault(
	Document document
)
Visual Basic
Public Shared Function CreateDefault ( _
	document As Document _
) As MultiReferenceAnnotationType
Visual C++
public:
static MultiReferenceAnnotationType^ CreateDefault(
	Document^ document
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document to be modified.
Return Value
 The new MultiReferenceAnnotationType element.
Remarks
 If there is no existing MultiReferenceAnnotationType a new one will be created, otherwise an exception will be thrown. Use Duplicate(String) to create all further MultiReferenceAnnotationTypes. The default MultiReferenceAnnotationType will use the document's current default linear dimension style and will have Structural Rebar as its reference category. No tag type will be set for the new MultiReferenceAnnotationType.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  document is not a project document. -or- There are existing MultiReferenceAnnotationTypes in the document.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
MultiReferenceAnnotationType Class
Autodesk.Revit.DB Namespace